

---ИМЕНА

###боба,бобу,бобом,бобе,бобы,бобам,бобами,бобах
@(\w+)([,: -]*)\s+Боб([аеуомыи]+)\b=$1$2 бОб$3

###волков
@(\w+)([,: -]*)\s+Волков\b=$1$2 вОлков

###господа
@(\w+)([ -]*)\s+Господа\b=$1$2 гОспода

###громов,громова,громову,громовой,громовою,громове,громовы,громовым,громовыми,громовых
@(\w+)([,: -]*)\s+Громов([омыий]*)\b=$1$2 грОмов$3

###дана,даны,дане,дану,даной,даною,данам,данами,данах
@(\w+)([,: -]*)\s+Дан([аыу]+)\b=$1$2 дАн$3

###женя,женю,жени,жене
@(\w+)([,: -]*)\s+Жен([еиюя]+)\b=$1$2 жЕн$3

###жуков
@(\w+)([,: -]*)\s+Жуков\b=$1$2 жукОв

###жучка,жучке,жучку
@(\w+)([,: -]*)\s+Жучк([аеу]+)\b=$1$2 жУчк$3

###зубов
@(\w+)([,: -]*)\s+Зубов\b=$1$2 зУбов

###костей
@(\w+)([,: -]*)\s+Костей\b=$1$2 кОстей

###куба
@(\w+)([,: -]*)\s+Куба\b=$1$2 кУба

###лады
@(\w+)([,: -]*)\s+Лады\b=$1$2 лАды

###ложи
@(\w+)([,: -]*)\s+Ложи\b=$1$2 лОжи

###ломов
@(\w+)([,: -]*)\s+Ломов\b=$1$2 лОмов

###лука
@(\w+)([,: -]*)\s+Лука\b=$1$2 лукА

###луки
@(\w+)([,: -]*)\s+Луки\b=$1$2 лукИ

###носов
@(\w+)([,: -]*)\s+Носов\b=$1$2 нОсов

###один
@(\w+)([,: -]*)\s+Один\b=$1$2 ъОдин

###ока
@(\w+)([,: -]*)\s+Ока\b=$1$2 окА

###оку
@(\w+)([,: -]*)\s+Оку\b=$1$2 окУ

###отчего
@(\w+)([,: -]*)\s+Отчего\b=$1$2 ъОтчего

###паша,паши,паше,пашу,пашой,пашою,пашам,пашами,пашах
@(\w+)([,: -]*)\s+Паш([аейуы]+)\b=$1$2 пАш$3

###проклятых
@(\w+)([,: -]*)\s+Проклятых\b=$1$2 прОклятых

###рогов
@(\w+)([,: -]*)\s+Рогов\b=$1$2 рОгов

###рожков,рожкова,рожкову,рожковой,рожковою,рожкове,рожковы,рожковым,рожковыми,рожковых
@(\w+)([,: -]*)\s+Рожков([аеуомыий]{0,3})\b=$1$2 рожкОв$3

###ростовом
@(\w+)([,: -]*)\s+Ростовом\b=$1$2 ростОвом

###семена

@(\w+)([,: -]*)\s+Семена\b=$1$2 семёна

###соколов
@(\w+)([,: -]*)\s+Соколов\b=$1$2 соколОв

###сомов
@(\w+)([,: -]*)\s+Сомов\b=$1$2 сОмов

###тем
@(\w+)([,: -]*)\s+Тем\b=$1$2 тём

###того
@(\w+)([,: -]*)\s+Того\b=$1$2 тОго

###толика,толику,толике
@(\w+)([,: -]*)\s+Толик([ауе]+)\b=$1$2 тОлик$3

###толстого,толстому,толстых
@(\w+)([,: -]*)\s+Толсто([умго]+)\b=$1$2 толстО$3
@(\w+)([,: -]*)\s+Толстых\b=$1$2 толстЫх

###тони
@(\w+)([,: -]*)\s+Тони\b=$1$2 тОни

###трою
@(\w+)([,: -]*)\s+Тро([яю])\b=$1$2 трО$3

###филе
@(\w+)([,: -]*)\s+Филе\b=$1$2 фИле

###хана
@(\w+)([,: -]*)\s+Хана\b=$1$2 хАна

###черепа
@(\w+)([,: -]*)\s+Черепа\b=$1$2 чЕрепа

###читой
@(\w+)([,: -]*)\s+Читой\b=$1$2 читОй

###юли,юля,юлю
@(\w+)([,: -]*)\s+Юл([июя]+)\b=$1$2 ъЮл$3

#::end:: -- обязательная строка в конце словаря!
